{"license":"MIT","file_hash":null,"name":"ACG Tools","version":"0.2.1","description":"Custom nodes created for ACG Architects","group":"","keywords":["acg"],"dependencies":[{"name":"Rhythm","version":"2021.1.1"}],"host_dependencies":["Revit","IronPython2"],"contents":"Data_CurrentDate - Generates today's date in the DD.MM.YY, DD/MM/DD or YYMMDD format., Data.Get Graph Path - Gets the parh of the active Dynamo graph, Data_ScriptUseLog - Adds an entry to TXT document every time a script is run. The document is located in R:\\Dynamo\\05-UsageStats, Elements_AllElementsOfFamilyType - Collects ann instance of a given family type (works for System families as well), Elements_CompoundStructureLayers - From Clockworks. Widths not working in mm, Elements_CopyToLevels - Copies elements to given levels., Elements_GetInserts - Collects all interted elements (doors, windows) from a host. From Clockworks, Elements_GetType - Gets types from given elements, including linked elements too. Taken from Clockworks, Elements_SetName - No description provided, Excel_ClearContent - Deletes data from Excel cells and removes any formatting. Taken from BumbleBee and updated., File.Get Parent Directory - Returns the parent folder of a given file or folder, File.Rename - Renames files by given directory, file extension, list of old file names and list of new file names, Geometry_ExpandBoundingBox - Expands element's bounding box. Taken from RIE, Geometry_FilterSurfaceByOrientation - Takes surfaces and filters them by orientation - vertical, horizontal down or horizontal up. Taken from Clockwork for Dynamo 2.x, Groups_AllInstancesOfType - Collects all instances of a given group type, Group_FromElements - Creates a model or a detail group from a list of elements, Group_GetMembers - Get all memeber elements of a group instance, List_MatchWithKeyValue - No description provided, QuickAudit_CADImportCheck - No description provided, QuickAudit_DuplicateLevelsCheck - No description provided, QuickAudit_FamilyNamingCheck - No description provided, QuickAudit_GroupsCheck - No description provided, QuickAudit_InPlaceFamiliesCheck - No description provided, QuickAudit_LevelsAndGridsCheck - No description provided, QuickAudit_RedundantAreaCheck - No description provided, QuickAudit_RedundantRoomCheck - No description provided, QuickAudit_RevisionCheck - Checks if PRODUCTION sheets have no revision or if there are revisions assigned to WIP sheets, QuickAudit_SheetNamingCheck - No description provided, QuickAudit_ViewNamingCheck - Check if views placed on \"DR\" sheets are named correctly, QuickAudit_ViewsOnSheetsNamingCheck - Check views placed on PRODUCTION sheets. Only Plans, Elevations and Sections, Room.Rename By Content - Renames a room by a family that is placed inside, Selection_AllElementsByCategoryName - Collects all elements of a given category name., Selection_AllElementsByTypeName - Collects all elements of a given type name., Selection_SelectModelElementsFromCategory - Taken from Rhythm - IsolatedPickModelElements and updated., Views_ByGeometry - Modified from Create Element View in the BIM4Struc package, Views_DisableTemporarylyHideIsolate - Disables the temporary hide and isolate settings on a given list of views., Views_RCPByRoom - Taken from Archi-lab and updated, Views_ViewType - Gets the type of a given view, Walls_GetOrientation - From Rhythm 2017. Gets the world orientation of a wall - south, north, east or west.","engine_version":"2.12.1.11123","engine":"dynamo","engine_metadata":"","site_url":"","repository_url":"","contains_binaries":false,"node_libraries":[]}